package Localization;

public class LocRu {
    public static final String YOU_HAVE_ALREADY_CREATED_HASH = "Вы уже создали Хэш-приглашение, поделитесь им с другом, чтобы начать Секретный чат.";
    public static final String NOW_YOU_CAN_SHARE_THIS_HASH = "<b>Теперь вы можете поделиться этим уникальным Хэшем чата с другим клиентом, чтобы создать Секретный чат \n\nПросто нажнимте на хэш для того, чтобы его скопировать!</b>";
    public static final String STOP_YOUR_CURRENT_CHAT_TO_CREATE = "Остановите ваш текущий Секретный чат, чтобы создать новое приглашение";
    public static final String STOP_YOUR_CURRENT_CHAT_TO_CONNECT = "Остановите текущий чат, чтобы подключиться к другому";
    public static final String YOU_CANNOT_START_WITH_YOURSELF = "Вы не можете начать Секретный чат сами с собой";
    public static final String HASH_OWNER_ALREADY_ANOTHER_CHAT = "Владелец Хэша уже начал другой секретный чат";
    public static final String SECRET_CHAT_STARTED = "Секретный чат успешно начат";
    public static final String HASH_IS_NOT_ACTIVE = "Хэш-приглашение, которое вы предоставили, не активно";
    public static final String HELP_MESSAGE = "Шаг 1: Создайте одноразовый Хэш\n" +
            "Откройте меню команд и используйте команду /new_hash для создания уникального одноразового Хэша. Этот Хэш будет служить эксклюзивным идентификатором вашей сессии чата.\n" +
            "\n" +
            "Шаг 2: Поделитесь Хэшем с другом\n" +
            "Поделитесь созданным Хэшем с другом и попросите его ввести его в чат. Это гарантирует, что все сообщения, которые вы отправляете NoNamesBot, будут автоматически перенаправлены вашему другу, без следов вашей личности.\n" +
            "\n" +
            "Шаг 3: Наслаждайтесь анонимным общением\n" +
            "Как только ваш друг вводит Хэш в чат, ваше общение становится полностью анонимным. Смело обменивайтесь сообщениями, не беспокоясь о раскрытии вашей истинной личности.\n" +
            "\n" +
            "<b>Важно отметить, что каждый Хэш имеет срок действия 5 дней. По истечении этого периода сеанс чата автоматически деактивируется, обеспечивая конфиденциальность ваших разговоров. Этот бот может отправлять только текст и смайлики, без медиафайлов или голоса. Все медиафайлы будут проигнорированы</b>\n" +
            "\n" +
            "Попробуйте NoNamesBot сегодня и ощутите свободу анонимного общения!";
    public static final String CURRENTLY_YOU_ARE_NOT_IN_CHAT = "В данный момент вы не находитесь в чате, и ваше сообщение не распознано. Используйте команду /new_hash, чтобы создать Хэш-приглашение";
    public static final String THERE_IS_NOTHING_TO_DELETE = "Нечего удалять или останавливать";
    public static final String YOUR_HASH_IS_OUTDATED = "Ваше приглашение устарело. Не стесняйтесь создать новое.";
    public static final String THE_LAST_HAS_BEEN_STOPPED = "Последний Секретный чат был остановлен. Не стесняйтесь создать новый.";
    public static final String PROMO_CODE_ACTIVATED = "Ваш промо код успешно активирован! Вы получили 1 год безлимитного использования.";
}
